Autodesk.Revit.UI.IContextMenuCreator.BuildContextMenu(Autodesk.Revit.UI.ContextMenu)
Build a Context Menu.
Remarks:
In this method, developer can add menu items to the passed in Autodesk.Revit.UI.ContextMenu object.
This callback will be called on every right-click in Canvas or ProjectBrowser.
Since:
2025

Autodesk.Revit.UI.IContextMenuCreator
Interface class for Context Menu creation.
Remarks:
In order to customize Autodesk Revit context menus, create a class that implements the IContextMenuCreator interface.
An IExternalApplication can register one or more IContextMenuCreator subclasses using the RegisterContextMenu() method.
Whenever an end user right-clicks in Canvas or ProjectBrowser, all IContextMenuCreator buildContextMenu implementations
are called on by one. Each buildContextMenu implementation is passed in an empty Autodesk.Revit.UI.ContextMenu object. Depending on the
active document, view and selection, you can add one or more MenuItems to the ContextMenu object. All MenuItems will be added
in the end of the context menu presented to the user.
Since:
2025